# PaletteCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..PaletteCount Property
FabricationService Class See Also
---
The number of palettes in the service.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public int PaletteCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PaletteCount As Integer
	Get
```

Visual C++
---
```text
public:
property int PaletteCount {
	int get ();
}
```

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace